IdeaRS.Connections
AddedMemberData.PlacementDefinition Property
Compatible with IDEA StatiCa 0.0
 Added beam placement in Connection by Directional vector (and not by Spherical coordinates - aplha, beta, gamma angles) If value equals to DirectionVector the values of DirVectX, DirVectY, DirVectZ are expected
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PlacementDefinitionType PlacementDefinition { get; set; }
Property Value
Type: PlacementDefinitionType
See Also
Reference
AddedMemberData Class
IdeaRS.Connections.Data Namespace